defl/hokku_epaper/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash - 16MB actual (board reports 16384k)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Console on USB Serial/JTAG (built-in USB)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Compiler — performance build (-O2), not debug (-Og)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# CPU — 240 MHz (ESP32-S3 max)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Instruction cache — 32 KB (firmware binary is ~700 KB; 16 KB thrashes)
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Main task stack (display + WiFi + HTTP needs headroom)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PSRAM (8MB octal, embedded in ESP32-S3-WROOM-1)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# WiFi - allocate buffers in SPIRAM when possible
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# SNTP
CONFIG_LWIP_SNTP_MAX_SERVERS=2
